app/Controllers/ApiController.php

    public function recibirJuegos(){

        $resultadoValidacion = $this->apiKeyValidator->validar($this->request, $this->response);

        if ($resultadoValidacion !== true) {
            return $resultadoValidacion;
        }

        try {

            $juegos = $this->VideojuegoModelo->findAll();
---
SELECT *
FROM "vault"."videojuegos"

    public function rellenarTablaVideojuegos($idsJuegos){
        $apiKey = "a9a117515a694c0fa91d404dd5ede441";
        $baseUrl = "https://api.rawg.io/api/games";


        $db = \Config\Database::connect();
        $db->transBegin();

        foreach ($idsJuegos as $key => $value) {
            $url = "$baseUrl/$value?key=$apiKey";
            $juegoData = [];

            $llamada_API = curl_init();
            curl_setopt($llamada_API, CURLOPT_URL, $url);
            curl_setopt($llamada_API, CURLOPT_RETURNTRANSFER, true);

            $response = curl_exec($llamada_API);

            curl_close($llamada_API);

            $data = json_decode($response, true);

            if ($this->VideojuegoModelo->where('nombre', $data['name'])->first()) {
---
SELECT *
FROM "vault"."videojuegos"
WHERE "nombre" = 'Grand Theft Auto V'
 LIMIT 1